Documents/Возврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Возврат</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Сумма</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СпособОплаты</Name>
      <ValueType><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/Оплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Оплаты</Name>
    <RegisterType>Turnover</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Назначение</Name>
      <ValueType><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Сумма</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>КоличествоОплат</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Enums/ВидыОперацийОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>ВидыОперацийОплат</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>ПокупкаАбонемента</Name>
    </Value>
    <Value>
      <Name>РазовоеЗанятие</Name>
    </Value>
    <Value>
      <Name>Продление</Name>
    </Value>
    <Value>
      <Name>ДополнительнаяУслуга</Name>
    </Value>
    <Value>
      <Name>Возврат</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Возврат/Ext/ObjectModule.bsl
// Модуль документа Возврат

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Регистрация возврата как обратного движения по оплатам
	НаборЗаписей = РегистрыНакопления.Оплаты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать();

	Движение = НаборЗаписей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Абонемент = Абонемент;
	Движение.Назначение = Перечисления.ВидыОперацийОплат.Возврат;
	Движение.Сумма = Сумма;
	Движение.КоличествоОплат = 1;

	НаборЗаписей.Записать();

	// Если абонемент возвращён полностью - статус "Отменён" и списание остатка
	Если Не ПустоеЗначение(Абонемент) Тогда
		АбКлиента = Абонемент.ПолучитьОбъект();
		Остаток = РаботаСОстаткамиАбонементов.ОстатокЗанятийПоАбонементу(АбКлиента.Ссылка);
		Если Остаток > 0 Тогда
			ДвиженияОстатки = Новый Массив;
			ДвижениеОстатки = Новый Структура("ВидДвижения, АбонементКлиента, КоличествоЗанятий");
			ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОстатки.АбонементКлиента = АбКлиента.Ссылка;
			ДвижениеОстатки.КоличествоЗанятий = Остаток;
			ДвиженияОстатки.Добавить(ДвижениеОстатки);
			РаботаСОстаткамиАбонементов.ЗаписатьДвиженияОстатки(Ссылка, Дата, ДвиженияОстатки);
		КонецЕсли;
		АбКлиента.Статус = Перечисления.СтатусыАбонементаКлиента.Отменён;
		АбКлиента.Записать();
	КонецЕсли;

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Возврат", "", "Клиент=" + Строка(Клиент) + ", Сумма=" + Строка(Сумма));
КонецПроцедуры
